BrentBaccala/CoCoA/src/AlgebraicCore/TmpMayerVietorisTree.C
//   Copyright (c)  2008-2009  Anna Bigatti and Eduardo Saenz-de-Cabezon

//   This file is part of the source of CoCoALib, the CoCoA Library.

//   CoCoALib is free software: you can redistribute it and/or modify
//   it under the terms of the GNU General Public License as published by
//   the Free Software Foundation, either version 3 of the License, or
//   (at your option) any later version.

//   CoCoALib is distributed in the hope that it will be useful,
//   but WITHOUT ANY WARRANTY; without even the implied warranty of
//   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//   GNU General Public License for more details.

//   You should have received a copy of the GNU General Public License
//   along with CoCoALib.  If not, see <http://www.gnu.org/licenses/>.

#include "CoCoA/TmpMayerVietorisTree.H"

#include "CoCoA/IntOperations.H"
#include "CoCoA/SparsePolyRing.H"
#include "CoCoA/TmpPPVector.H"
#include "CoCoA/VectorOperations.H"   // for product
#include "CoCoA/ideal.H"
#include "CoCoA/ring.H"
#include "CoCoA/utils.H"

#include <iostream>
// #include <list>
using std::list;
#include <utility>
using std::pair;
// #include <vector> --- already included in TmpPPVector.H
using std::vector;

using std::endl;
/**********************************************************/
namespace CoCoA
{

  class MVTN1Node
  {
  public:
    MVTN1Node(PPMonoid PPM, DivMaskRule DMR);
    ~MVTN1Node() {};
  public:
    unsigned int pos;
    unsigned int dim;
    PPVector the_ideal;
    //varlist used_vars;
  };

  MVTN1Node::MVTN1Node(PPMonoid PPM, DivMaskRule DMR):
    the_ideal(PPM, DMR)
  { }
  

  typedef list<MVTN1Node> N1tree;



//******************************************************************//
//           TREES, NODES and BINODOS                               //
//******************************************************************//

//These types include everything needed to build a Mayer-Vietoris tree, in which each node is defined by a monomial ideal, a position and a dimension
//Binodos are the types in which the result of the computation of MAyer-Vietoris trees will be stored. A binodo has a multidegree and a list_of_dims

  class MVTNode
  {
  public:
    MVTNode(PPMonoid PPM, DivMaskRule DMR);
    ~MVTNode() {};
  public:
    position_t pos;
    unsigned int dim;
    PPVector the_ideal;
    //varlist used_vars;
  };

  MVTNode::MVTNode(PPMonoid PPM, DivMaskRule DMR):
    the_ideal(PPM, DMR)
  { }
  

  typedef list<MVTNode> tree;



  namespace // anonymous for functions local to this file/compilation unit.
  {

    void tilde(PPVector& g, PPVector& I)
    {
      PPVector m(PPM(I), DMR(I));
      PushBackPopBack(m, I);
      lcms(g,m,I);
      InterreduceSort(g);
    }
  

    bool HasHomology(const PPWithMask& pp, const PPVector& J)
    {
      PPMonoid M=owner(PP(pp));
      int n=NumIndets(M);
      PPMonoidElem ppi=PP(pp)/product(indets(M));
      if (IsDivisible(ppi, J))
        return false;
      else
        for (int i=0; i<n; ++i)
          if (!IsDivisible(indet(M,i)*ppi, J))
            return false;
      return true;
    }

bool HasHomology_gen(const PPWithMask& pp, const PPVector& J, const PPMonoidElem& m)
    {
      PPMonoid M=owner(PP(pp));
      int n=NumIndets(M);
      PPMonoidElem ppi=(PP(pp)*m)/product(indets(M));
      if (IsDivisible(ppi, J))
        return false;
      else
        for (int i=0; i<n; ++i)
	if(exponent(m,i)==0)
	{
          if (!IsDivisible(indet(M,i)*ppi, J))
            {return false;}
	}
	 return true;
    }
    /////////////// new code 4-july-2008
//This file contains the basic structures that will be used in the computation of Mayer-Vietoris trees and the basic functions involving them.







//*******************************************************//
//*******************************************************//
//          F U N C T I O N S                            //
//*******************************************************//
//*******************************************************//
//*******************************************************//





// FUNCTIONS FOR THE CONTAINER OF MULTIDEGREES, DIMENSIONS AND POSITIONS:   //

MultidegreeMap::iterator special_insert(const PPMonoidElem& , const int& , const position_t& , MultidegreeMap& /* ,MultidegreeMap::iterator*/);

// void put(MultidegreeMap&);

// void put(ListOfDims&);

// AUXILIARY FUNCTIONS FOR INTEGERS AND LISTS OF INTEGERS //

int number_zeros(list<int> );

void binary_expression(position_t , list<int>& );


//const int N=100;//NUMBER OF VARIABLES





// FUNCTIONS FOR THE CONTAINER OF MULTIDEGREES, DIMENSIONS AND POSITIONS:   //



MultidegreeMap::iterator special_insert(const PPMonoidElem& multidegree, const int& dimension, const position_t& position, MultidegreeMap& the_list /*, MultidegreeMap::iterator insertion_hint*/)
{

list<position_t> thispos;
thispos.push_front(position);

ListOfDims to_insert;
to_insert.insert(std::make_pair(dimension,thispos));

std::pair<MultidegreeMap::iterator, bool> insertion;

insertion=the_list.insert(/*insertion_hint,*/ std::make_pair(multidegree,to_insert));//WHAT ABOUT THE INSERTION HINT???

MultidegreeMap::iterator insert_point=insertion.first;

if (!insertion.second)
	{
	pair<ListOfDims::iterator, bool> inner_insertion;
	inner_insertion=(insert_point->second).insert(std::make_pair(dimension,thispos)); //repeated, use a variable!
	if (!inner_insertion.second)
		{
		(inner_insertion.first->second).push_front(position);
		}	
		
	}
return insert_point;
}


    void output(std::ostream& out, const ListOfDims& the_list)
    {
      ListOfDims::const_iterator pos;
      for (pos= the_list.begin(); pos!=the_list.end();++pos)
      {
	out<<pos->first<<":"<<pos->second<<endl;
      }
    }


    void output(std::ostream& out, const MultidegreeMap& the_list)
    {
      MultidegreeMap::const_iterator pos;
      for (pos= the_list.begin(); pos!=the_list.end();++pos)
      {
	out<<pos->first<<endl;
	output(out, pos->second);
	out<<"size of the list:"<<len(pos->second)<<endl;
      }
    }


    std::ostream& operator<<(std::ostream& out, const MultidegreeMap& the_list)
    {
      output(out, the_list);
      return out;
    }

// AUXILIARY FUNCTIONS FOR INTEGERS AND LISTS OF INTEGERS //


