BrentBaccala/CoCoA/src/AlgebraicCore/TmpMayerVietorisTree.C
int number_zeros(list<int> L)
{
int n=0;
list<int>::iterator p = L.begin();
while (p!=L.end())
	{
	if(*p==0)
		{
		n++;
		}
	p++;
	}
return n;
}

void binary_expression(position_t n, list<int>& L)
{
if (n<2)
	{ if (n == 0) L.push_front(0); else L.push_front(1);}
	else
		{
		  if (n%2 == 0) L.push_front(0); else L.push_front(1);
		binary_expression(n/2,L);
		}
}

//
//
//
//
//



//----------------------------------------------------------------------

bool test_pos(position_t p1, position_t p2)
{
list<int> b1,b2;

binary_expression(p1,b1);
binary_expression(p2,b2);

while (b1.front()==b2.front())
	{
	b1.pop_front();
	b2.pop_front();
	}
if(b1.front()==0)
	{
	return(number_zeros(b1)-1==number_zeros(b2));
	}
	else
		{
		return(number_zeros(b2)-1==number_zeros(b1));
		}
}


// 20140809 JAA commented out because never used.
// void remove_pairs(list<position_t>& l1, list<position_t>& l2)
// {
//  std::list<position_t>::iterator p=l1.begin();
//  while (p!=l1.end())
//  	{
//  	std::list<position_t>::iterator q=l2.begin();
//  	bool found= false;
// 	while (!found && q!=l2.end())
//  		{
// 		if(test_pos(*p,*q))
// 			{
// 			found=true;
// 			p=l1.erase(p);
// 			q=l2.erase(q);
// 			}
// 			else
// 				{
// 				++q;
// 				}
// 		}
// 	if(!found && p!=l1.end())
// 		{
// 		++p;
// 		}
// 	}

// }

void reduce_list (ListOfDims& the_list, ListOfDims& undecided_list) //reduces the list according to the position criterion 
								    //VERY inefficient version!!
{
ListOfDims decided;
//list<position_t> this_undecided, this_decided;
 long k=len(the_list);
int l=0;
int m=0;
//FIRST TEST 
//If the multidegree only appears twice in the tree, then it is a reduction pair iff the positions are couple
// if (k==2)
// 	{
// 	l=len((the_list.begin())->second);//cout<<"l="<<l;
// 	m=len((++the_list.begin())->second);//cout<<"m="<<m<<endl;
// 
// 	if (l==1 and m==1)
// 		{
// 		if (test_pos((the_list.begin())->second.front(),(++the_list.begin())->second.front()))
// 			{
// 			the_list.clear();
// 			}
// 		}
// 	}
//SECOND TEST
//Every multidegree with no couples cannot be part of a reduction pair
 if (len(the_list)>1)
	{
	ListOfDims::iterator p=the_list.begin();
	
	while (p!=the_list.end())
		{
		int i=p->first;
		
		std::list<position_t>::iterator r=p->second.begin();
		while (r!=p->second.end())
			{
			bool found=false;
			ListOfDims::iterator q=the_list.begin();		
			while (q!=the_list.end())
				{
				if(q->first==i+1 || q->first==i-1)
					{
					std::list<position_t>::iterator s=q->second.begin();
					while(s!=q->second.end() && !found)
						{
						if (test_pos(*r,*s))
							{
							list<int> b1,b2;
							binary_expression(*r,b1);
							binary_expression(*s,b2);
							//cout<<"test da 1"<<"bin"<<*r<<"="<<b1<<"::"<<*s<<"="<<b2<<endl;
							found=true;
							undecided_list[p->first].push_front(*r);
							}
							else
							{
							++s;
							}
						}
					++q;
					}
				else
					{
					++q;
					}
				}
			if(!found)
				{
				decided[p->first].push_front(*r);
				}
			++r;
			}
		//swap(undecided_list[p->first],p->second);
// 		undecided_list.insert(std::make_pair(p->first,this_undecided));
		//decided.insert(std::make_pair(p->first,this_decided));
		
		++p;
		}
	swap(the_list,decided);
	}

//THIRD TEST
//If the list has two dimension and one has more elements than the other, some of these will have no pair
//Warning! no position-based tests allowed after this
 k=len(undecided_list);
if (k==2)
	{
          l=len((undecided_list.begin())->second);//cout<<"l und="<<l;
          m=len((++undecided_list.begin())->second);//cout<<"m und="<<m<<endl;
	if (l>m)
		{
		for (int i=0;i<l-m;i++)
			{
			the_list[(undecided_list.begin())->first].push_front((undecided_list.begin())->second.front());
			(undecided_list.begin())->second.pop_front();
			}
		}
	if (m>l)
		{
		for (int i=0;i<m-l;i++)
			{
			the_list[(++undecided_list.begin())->first].push_front((++undecided_list.begin())->second.front());
			(++undecided_list.begin())->second.pop_front();
			}
		}
	}
}


//////////////////



  }  // end of anonymous namespace

  void ReduceMVTree(MultidegreeMap& the_map, MultidegreeMap& undecided_map)
  {
    MultidegreeMap::iterator pos;
MultidegreeMap::iterator undec_pos=undecided_map.begin();
for (pos=the_map.begin(); pos!=the_map.end();)
	{
	ListOfDims undecided_list;
	//cout<<"lista inicial";put(pos->second);cout<<"::";
	reduce_list(pos->second, undecided_list);
	
 	if (!undecided_list.empty())
 		{
		//cout<<pos->first<<endl;
		//cout<<"reducida ";put(pos->second);cout<<":: undecided ";put(undecided_list);cout<<endl;
 		undecided_map.insert(undec_pos,std::make_pair(pos->first,undecided_list));
 		}
	if (pos->second.empty())
		{
		the_map.erase(pos++);
		}
	else{++pos;}
	}

  }
  

  void MayerVietorisTreeN1(PPVector& betti, const PPVector& I)
  {
    PPVector N1(PPM(I), DMR(I));
    N1tree T;
    unsigned int N=NumIndets(PPM(betti));
    PPVector J=I;
    InterreduceSort(J);
    MVTN1Node nodo(PPM(J), DMR(J));
    swap(nodo.the_ideal, J);
    nodo.pos=1; nodo.dim=0;
    T.push_back(nodo);


    if (len(J)==1) return;

    N1tree undone=T;
    MVTN1Node new_node(PPM(J), DMR(J));
    int mipos, midim;
    PPVector mi_ideal(PPM(J), DMR(J));
    
    while (!undone.empty())
    {
      swap(mi_ideal, undone.front().the_ideal);
      mipos=undone.front().pos;
      midim=undone.front().dim;
      undone.pop_front();
      
      tilde(new_node.the_ideal, mi_ideal);
      
      //left child
      new_node.pos=mipos*2;
      new_node.dim=midim+1;
      
      if (new_node.dim==N-1)
      {for (long i=0; i<len(new_node.the_ideal); ++i)
          if (HasHomology(new_node.the_ideal[i], I))
            N1.myPushBack(new_node.the_ideal[i]);
	}
      else
	{
    if (len(new_node.the_ideal)>1 && len(new_node.the_ideal)+new_node.dim-1>=N-1 /* && HAS FULL SUPPORT*/)
        undone.push_back(new_node);
	}
      //right child
      new_node.pos = 1+mipos*2;
      new_node.dim = midim;
      swap(new_node.the_ideal, mi_ideal);
      if (len(new_node.the_ideal)>1 && len(new_node.the_ideal)+new_node.dim-1>=N-1)
        undone.push_back(new_node);
    }
    swap(betti, N1);
  }


//   void MayerVietorisTreeN1_gen(PPVector& betti, const PPVector& I, const PPMonoidElem& m, int cont)
//   {
// 
//     PPVector N1(PPM(I), DMR(I));
//     N1tree T;
//     unsigned int N=NumIndets(PPM(betti));
//     PPVector J=I;
//     InterreduceSort(J);
//     MVTN1Node nodo(PPM(J), DMR(J));
//     swap(nodo.the_ideal, J);
//     nodo.pos=1; nodo.dim=0;
//     T.push_back(nodo);
// 
// 
//     if (J.mySize()==1) 
// 	{
// 	if (N-cont==1)
// 		{betti.myPushBack(J[0]);}
// 		else{return;}
// 	}
// 
// 
//     N1tree undone=T;
//     MVTN1Node new_node(PPM(J), DMR(J));
//     int mipos, midim;
//     PPVector mi_ideal(PPM(J), DMR(J));
//     
//     while (!undone.empty())
//     {
//       swap(mi_ideal, undone.front().the_ideal);
//       mipos=undone.front().pos;
//       midim=undone.front().dim;
//       undone.pop_front();
//       
//       tilde(new_node.the_ideal, mi_ideal);
//       
//       //left child
//       new_node.pos=mipos*2;
//       new_node.dim=midim+1;
//       
//       if (new_node.dim==N-cont-1)
//         {for (unsigned int i=0; i<new_node.the_ideal.mySize(); ++i)
//           if (HasHomology_gen(new_node.the_ideal[i], I,m))
//             N1.myPushBack(new_node.the_ideal[i]);
// 	}
// 	else
// 	{
//    	   if (new_node.the_ideal.mySize()>1 && new_node.the_ideal.mySize()+new_node.dim-1>=N-cont-1)
//      	   undone.push_back(new_node);
// 	}
// 
//       //right child
//       new_node.pos = 1+mipos*2;
//       new_node.dim = midim;
//       swap(new_node.the_ideal, mi_ideal);
//       if (new_node.the_ideal.mySize()>1 && new_node.the_ideal.mySize()+new_node.dim-1>=N-cont-1)
//         undone.push_back(new_node);
//     }
//     swap(betti, N1);
//   }



void SimplicialMayerVietorisTree(vector<int>& ranks, const PPVector& I)
  {
    N1tree T;
    //    unsigned int N=NumIndets(PPM(I));
    PPVector J=I;
    InterreduceSort(J);
    MVTN1Node nodo(PPM(J), DMR(J));
    swap(nodo.the_ideal, J);
    nodo.pos=1; nodo.dim=0;
    T.push_back(nodo);

    if (len(J)==1) return;

    N1tree undone=T;
    MVTN1Node new_node(PPM(J), DMR(J));
    int mipos, midim;
    PPVector mi_ideal(PPM(J), DMR(J));
    PPWithMask prod_vars(product(indets(PPM(J))),DMR(J));

    if (len(J)==1) return;
    
    while (!undone.empty())
    {
      swap(mi_ideal, undone.front().the_ideal);
      mipos=undone.front().pos;
      midim=undone.front().dim;
      undone.pop_front();
      
