BrentBaccala/CoCoA/src/AlgebraicCore/TmpMayerVietorisTree.C
      tilde(new_node.the_ideal, mi_ideal);
      
      //left child
      new_node.pos=mipos*2;
      new_node.dim=midim+1;

//TO MAKE THE PRODUCT AND TEST IF THERE IS FULL SUPPORT
	
      if (len(new_node.the_ideal)==1)
		{
		ranks[new_node.dim]++;
		}
	else	{
		undone.push_back(new_node);
		}
	
        
      //right child
	swap(new_node.the_ideal, mi_ideal);
	PPMonoidElem my_producto=PP(new_node.the_ideal[0]);
	for (long k=1; k<len(new_node.the_ideal); ++k)
          my_producto=my_producto*PP(new_node.the_ideal[k]);
// 	std::cout<<new_node.the_ideal<<endl;      
// 	std::cout<<my_producto<<endl;
// 	std::cout<<prod_vars<<endl;
// 	std::cout<<"::"<<IsDivisibleFast(PPWithMask(my_producto,DMR(J)), prod_vars)<<endl;
      new_node.pos = 1+mipos*2;
      new_node.dim = midim;

      
      if (len(new_node.the_ideal)>1 && IsDivisibleFast(PPWithMask(my_producto,DMR(J)), prod_vars))
       undone.push_back(new_node);

    }

  }
void MayerVietorisTree(MultidegreeMap& output_list, const PPVector& I)
{

  tree undone;
  MVTNode nodo(PPM(I), DMR(I));
  MultidegreeMap::iterator insert_pos;
  PPVector J=I;
  InterreduceSort(J);
  swap(nodo.the_ideal, J);
  nodo.pos=1; nodo.dim=0;
  undone.push_back(nodo);
  for (long i=0; i < len(nodo.the_ideal); ++i)    //inserting all the relevant monomials in a binary tree
  {
    insert_pos=special_insert(PP(nodo.the_ideal[i]),nodo.dim,nodo.pos, output_list /* ,insert_pos*/);
  }
  if (len(nodo.the_ideal)>1) 
  {

    MVTNode minodo(PPM(J), DMR(J));
    MVTNode new_node(PPM(J), DMR(J));
    position_t mipos;
    int midim;
    PPVector mi_ideal(PPM(J), DMR(J));
    PPVector mi_tilde(PPM(J), DMR(J));
    PPVector mi_prime(PPM(J), DMR(J));

    while (!undone.empty())
    {
      swap(mi_ideal,undone.front().the_ideal);
      mipos=undone.front().pos; midim=undone.front().dim;
      undone.pop_front();


      tilde(new_node.the_ideal,mi_ideal);

      //left child
      new_node.pos=mipos*2;
      new_node.dim=midim+1;
      //first insert the first monomial of the node, and obtain the position in which it was inserted
      insert_pos=special_insert(PP(new_node.the_ideal[0]),new_node.dim,new_node.pos, output_list /*, output_list.begin()*/);
      // 		
      for (long i=1; i < len(new_node.the_ideal); ++i)    //inserting all the relevant monomials in a binary tree
      {	
        insert_pos=special_insert(PP(new_node.the_ideal[i]),new_node.dim,new_node.pos, output_list /* ,insert_pos*/);

      }; 
		
      if (len(new_node.the_ideal)>2) {undone.push_back(new_node);}
      else
      {
        if (len(new_node.the_ideal)==2)
        {
          insert_pos=special_insert(lcm(PP(new_node.the_ideal[0]),PP(new_node.the_ideal[1])),1+new_node.dim,2*new_node.pos, output_list /* ,insert_pos*/);
        }
      }


      //right child
      new_node.pos=1+mipos*2;
      new_node.dim=midim;
      swap(new_node.the_ideal,mi_ideal);
		
      if (len(new_node.the_ideal)>2) {undone.push_back(new_node);}
      else
      {
        if (len(new_node.the_ideal)==2)
        {
          insert_pos=special_insert(lcm(PP(new_node.the_ideal[0]),PP(new_node.the_ideal[1])),1+new_node.dim,2*new_node.pos, output_list /* ,insert_pos*/);
        }
      }
      
    }


  }
}




void MayerVietorisTreeExtremal(MultidegreeMap& output_list, list<PPMonoidElem>& /*extremal*/, const PPVector& I) //for the CoCoA school 2009
{

  tree undone;
  MVTNode nodo(PPM(I), DMR(I));

  PPVector J=I;
  InterreduceSort(J);
  swap(nodo.the_ideal, J);
  nodo.pos=1; nodo.dim=0;
  undone.push_back(nodo);

  if (len(nodo.the_ideal)>1)
  {

    MVTNode minodo(PPM(J), DMR(J));
    MVTNode new_node(PPM(J), DMR(J));
    position_t mipos;
    int midim;
    PPVector mi_ideal(PPM(J), DMR(J));
    PPVector mi_tilde(PPM(J), DMR(J));
    PPVector mi_prime(PPM(J), DMR(J));

    while (!undone.empty())
    {
      swap(mi_ideal,undone.front().the_ideal);
      mipos=undone.front().pos; midim=undone.front().dim;
      undone.pop_front();


      tilde(new_node.the_ideal,mi_ideal);

      //left child
      new_node.pos=mipos*2;
      new_node.dim=midim+1;
      //first insert the first monomial of the node, and obtain the position in which it was inserted
      MultidegreeMap::iterator insert_pos=special_insert(PP(new_node.the_ideal[0]),new_node.dim,new_node.pos, output_list /*, output_list.begin()*/);
      // 		
      for (long i=1; i < len(new_node.the_ideal); ++i)    //inserting all the relevant monomials in a binary tree
      {	
        insert_pos=special_insert(PP(new_node.the_ideal[i]),new_node.dim,new_node.pos, output_list /* ,insert_pos*/);

      }; 
		
      if (len(new_node.the_ideal)>1) {undone.push_back(new_node);}


      //right child
      new_node.pos=1+mipos*2;
      new_node.dim=midim;
      swap(new_node.the_ideal,mi_ideal);
		
      if (len(new_node.the_ideal)>1) {undone.push_back(new_node);}
		
    }


  }
}























// void ReducedMayerVietorisTree(MultidegreeMap& output_list, const PPVector& I)
// {
//   MayerVietorisTree(output_list, I);
//   ReduceMVTree(output_list);
// }


void Bettis(vector<int>& bettis, const MultidegreeMap& the_list)
{
  MultidegreeMap::const_iterator pos;
  for (pos= the_list.begin(); pos!=the_list.end();++pos)
  {
    ListOfDims::const_iterator inner_pos;
    for (inner_pos= (pos->second).begin(); inner_pos!=(pos->second).end();++inner_pos)
    {
      bettis[inner_pos->first] += len(inner_pos->second);
    }
  }
}


int ResSize(const vector<int>& R)
{
  vector<int>::const_iterator pos;
  int my_size=0;
  for(pos=R.begin(); pos!=R.end();++pos)
  {
    my_size+=*pos;
  }
  return my_size;
}




void GradedBettis(const MultidegreeMap& decided,BettiPseudoDiagram& graded_bettis, int& reg, int& pd)
{
reg=-1;pd=-1;
if (!decided.empty())
{
MultidegreeMap::const_iterator pos;
pd=0;
for (pos= decided.begin(); pos!=decided.end();++pos)
	{
	int deg=StdDeg(pos->first);
	
	ListOfDims::const_iterator inner_pos;
	for (inner_pos= (pos->second).begin(); inner_pos!=(pos->second).end();++inner_pos)
		{
                  if (graded_bettis[deg-(inner_pos->first)].empty())
			{
			int N=NumIndets(owner(pos->first));
			graded_bettis[deg-(inner_pos->first)].resize(N);
			}
		
                  graded_bettis[deg-(inner_pos->first)][inner_pos->first]+=len(inner_pos->second);
		if(inner_pos->first > pd)
			{
			pd=inner_pos->first;
			}
		}

