BrentBaccala/CoCoA/src/AlgebraicCore/TmpMayerVietorisTree.C
	}
reg=(--graded_bettis.end())->first;
}
}

int regularity(const MultidegreeMap& decided)
{
int reg=0;
if (!decided.empty())
{
MultidegreeMap::const_iterator pos;
for (pos= decided.begin(); pos!=decided.end();++pos)
	{
	int deg=StdDeg(pos->first);
	ListOfDims::const_iterator inner_pos;
	for (inner_pos= (pos->second).begin(); inner_pos!=(pos->second).end();++inner_pos)
		{
		if(deg-(inner_pos->first)>reg)
		 reg=deg-inner_pos->first;
		}

	}
}
return reg;
}



// int RegularityFromGradedBetti( const BettiPseudoDiagram& diagram)
// {
// return (--diagram.end())->first;
// }

void PrintBettiDiagram(const BettiPseudoDiagram& graded_bettis)
{
BettiPseudoDiagram::const_iterator pos;
for (pos= graded_bettis.begin(); pos!=graded_bettis.end();++pos)
	{
	std::cout<<pos->first<<" : "<<pos->second<<endl;
	}
}

void PseudoBettiDiagram(const BettiPseudoDiagram& decided, const BettiPseudoDiagram& undecided)
{
BettiPseudoDiagram::const_iterator pos, posdec;
posdec=decided.begin();
pos= undecided.begin();
while (posdec!=decided.end() && pos!=undecided.end())
 {
 if(posdec->first<pos->first)
  {
   std::cout<<posdec->first<<" : ";
   for (long i=0; i!=len(posdec->second); ++i)
     std::cout<<posdec->second[i]<<" , ";
   std::cout<<endl;
   posdec++;
  }
  else 
   {
   if(pos->first<posdec->first)
    {
     std::cout<<pos->first<<" : ";
     for (long i=0; i!=len(pos->second); ++i)
      {
      std::cout<<"0-"<<pos->second[i]<<" , ";	
      }
     std::cout<<endl;
     pos++;
    }
   }
while (pos->first==posdec->first)
	{
	 std::cout<<pos->first<<" : ";
	 for (long i=0; i!=len(pos->second); ++i)
	  {
	    if(pos->second[i]>0)
	 	{
	 	 std::cout<<posdec->second[i]<<"-"<<posdec->second[i]+pos->second[i]<<" , ";
	  	}
	    else
	  	{
	 	 std::cout<<posdec->second[i]<<" , ";
	 	}
	  }
	std::cout<<endl;
	posdec++;
        pos++;
	}
// std::cout<<(posdec==decided.end())<<endl;
// std::cout<<"pos: "<<pos->first<<"posdec: "<<posdec->first<<endl;
 //Si hemos llegado al final de decided, imprimimos undecided
 if(posdec==decided.end())
  {
    for (/*pos*/; pos!=undecided.end(); pos++)
	{
	std::cout<<pos->first<<" : ";
	for (long i=0; i!=len(pos->second); ++i)
	 {
	   if(pos->second[i]>0)
		{
		 std::cout<<"0-"<<pos->second[i]<<" , ";
		}
	   else
		{
		 std::cout<<"0 , ";
		}
	 }
	std::cout<<endl;
	}
  }
 else //si hemos llegado al final de undecided, imprimimos decided
   {if(pos==undecided.end())
    {
      for (/*posdec*/; posdec!=decided.end(); ++posdec)
      {
	std::cout<<posdec->first<<" : ";
        const long n = len(posdec->second);
	for (long i=0; i!=n; ++i)
	  std::cout<<posdec->second[i]<<" , ";	
	std::cout<<endl;
      }
    }
   }
}

	
}


void PrintMultidegreeMap(const MultidegreeMap& myMap)
{
MultidegreeMap::const_iterator pos;
for (pos= myMap.begin(); pos!=myMap.end();++pos)
	{
	std::cout<<"Multidegree: "<<pos->first<<" Degree: "<<StdDeg(pos->first)<<endl;
 	ListOfDims::const_iterator inner_pos;
	for (inner_pos= (pos->second).begin(); inner_pos!=(pos->second).end();++inner_pos)
 		{
		std::cout<<"Dimension: "<<inner_pos->first<<", Positions: "<<inner_pos->second<<endl;
 		}

	}
}

void PrintMultidegreeMapDim(const MultidegreeMap& myMap)
{
MultidegreeMap::const_iterator pos;
vector<list<position_t> > thispositions (NumIndets(owner(myMap.begin()->first)));
vector<list<PPMonoidElem> > thismultis(NumIndets(owner(myMap.begin()->first)));
for (pos= myMap.begin(); pos!=myMap.end();++pos)
	{
	PPMonoidElem thismulti=pos->first;
 	ListOfDims::const_iterator inner_pos;
	for (inner_pos= (pos->second).begin(); inner_pos!=(pos->second).end();++inner_pos)
 		{
		list<position_t>::const_iterator dims_pos;
		for (dims_pos= (inner_pos->second).begin(); dims_pos!=(inner_pos->second).end();++dims_pos)
			{
			thispositions[inner_pos->first].push_front(*dims_pos);
			thismultis[inner_pos->first].push_front(thismulti);
			}
// 		std::cout<<"Dimension: "<<inner_pos->first<<", Positions: "<<inner_pos->second<<endl;
 		}

	}
int cont=0;
while (!thispositions[cont].empty())
	{
          std::cout<<"Dimension: "<<cont<<" ( "<<len(thispositions[cont])<< " )"<<endl;
	list<position_t>::const_iterator pos;
	list<PPMonoidElem>::const_iterator pos_mult=thismultis[cont].begin();
	for (pos=thispositions[cont].begin(); pos!=thispositions[cont].end();++pos)
		{
		std::cout<<(*pos)<<"--"<<(*pos_mult)<<endl;
		++pos_mult;
		}
	cont++;
	}
}

void irreducible(vector<PPVector>& f, const PPVector& components, const PPMonoidElem& lambda)
{
PPMonoid P=PPM(components);

int N=NumIndets(P);

 for(long i=0;i<len(components);i++)
 {
 PPVector g(PPM(components), DMR(components));
 for(int j=0;j<N;j++)
  {
  if(exponent(PP(components[i]),j)<=exponent(lambda,j))
   {
   g.myPushBack(power(indet(P,j),exponent(PP(components[i]),j)));
   }
  }
 f.push_back(g);
 }
}


//INTERFACE FUNCTIONS FOR THE MVT PACKAGE

//1- OUTPUT OF MAYER-VIETORIS TREES
//1a- THE OUTPUT IS BY MULTIDEGREE
void MVTPrint(const PPVector& I)
{
MultidegreeMap output_list;
MayerVietorisTree(output_list, I);
PrintMultidegreeMap(output_list);
}


//1b- THE OUTPUT IS BY DIMENSIONS

void MVTPrintDim(const PPVector& I)
{
MultidegreeMap output_list;
MayerVietorisTree(output_list, I);
PrintMultidegreeMapDim(output_list);
}


//2- OUTPUT PSEUDO BETTI DIAGRAM
void MVTPseudoBettiDiagram(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec,undec;
int reg1,pd1,reg2,pd2;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
GradedBettis(undecided,undec,reg2,pd2);
PseudoBettiDiagram(dec, undec);
}

//3- REGULARITY AND BOUNDS
int MVTRegularityLowerBound(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec;
int reg1,pd1;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
return reg1;
}
int MVTRegularityUpperBound(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec,undec;
int reg1,pd1,reg2,pd2;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
GradedBettis(undecided,undec,reg2,pd2);
if (reg2>reg1) return reg2;
  else return reg1;
}

