BrentBaccala/CoCoA/src/AlgebraicCore/TmpMayerVietorisTree.C
int MVTRegularity(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec,undec;
int reg1,pd1,reg2,pd2;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
GradedBettis(undecided,undec,reg2,pd2);
if (reg2>reg1) {return -1;}
  else return reg1;
}


// int MVTRegularity(const PPVector& I) //Innefficient, computes twice!
// {
// int r1,r2;
// r1=MVTRegularityUpperBound(I);
// r2=MVTRegularityLowerBound(I);
// if (r1>r2) return -1;
//   else return r1;
// }



//4- PROJECTIVE DIMENSION AND BOUNDS
int MVTProjDimLowerBound(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec;
int reg1,pd1;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
return pd1;
}
int MVTProjDimUpperBound(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec,undec;
int reg1,pd1,reg2,pd2;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
GradedBettis(undecided,dec,reg2,pd2);
if (pd2>pd1) return pd2;
  else return pd1;
}

int MVTProjDim(const PPVector& I)
{
MultidegreeMap decided, undecided;
BettiPseudoDiagram dec,undec;
int reg1,pd1,reg2,pd2;
MayerVietorisTree(decided, I);
ReduceMVTree(decided,undecided);
GradedBettis(decided,dec,reg1,pd1);
GradedBettis(undecided,dec,reg2,pd2);
if (pd2>pd1) return -1;
  else return pd1;
}

//---- handy interface -----------------------------------------------
std::vector<RingElem> MayerVietorisTreeN1(const ideal& I)
{
  if (!IsSparsePolyRing(RingOf(I)))
    CoCoA_ERROR(ERR::NotSparsePolyRing, "MayerVietorisTreeN1(I)");
  if (!AreGensMonomial(I))
    CoCoA_ERROR(ERR::NotMonomialGens, "MayerVietorisTreeN1(I)");
  ///  if (!gens(I).empty())
  {
    // convert input into PPVector, operate, convert back
    const SparsePolyRing P = RingOf(I);
    PPVector gensI(PPM(P), NewDivMaskEvenPowers());
    const std::vector<RingElem>& l1 = gens(I);
    for (vector<RingElem>::const_iterator it=l1.begin(); it!=l1.end() ; ++it)
      PushBack(gensI, LPP(*it));
    PPVector betti(PPM(P), DMR(gensI));
    MayerVietorisTreeN1(betti, gensI);
    std::vector<RingElem> res;
    convert(res, P, betti);
    return res;
  }
}


/*
-- by Eduardo Saenz de Cabezon -------------------------------------
Define MVT5(X)
  Computation := "Mayer_Vietoris_Tree";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVT5

Define MayerVietorisTreeN1(X)
  Computation := "MVT_N_minus_one";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MayerVietorisTreeN1

Define MVTReg5(X)
  Computation := "MVT_Regularity";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTReg5

Define MVTRegUpperBound5(X)
  Computation := "MVT_Regularity_Upper_Bound";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTRegUpperBound5

Define MVTRegLowerBound5(X)
  Computation := "MVT_Regularity_Lower_Bound";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTRegLowerBound5

Define MVTProjDim5(X)
  Computation := "MVT_ProjDim";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTProjDim5

Define MVTProjDimUpperBound5(X)
  Computation := "MVT_ProjDim_Upper_Bound";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTProjDimUpperBound5

Define MVTProjDimLowerBound5(X)
  Computation := "MVT_ProjDim_Lower_Bound";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MVTProjDimLowerBound5

Define IsMonomialIrreducible5(X)
  Computation := "Monomial_Is_Irreducible";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MonomialIsIrreducible5

Define IsMonomialPrime5(X)
  Computation := "Monomial_Is_Prime";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MonomialIsPrime5

Define IsMonomialPrimary5(X)
  Computation := "Monomial_Is_Primary";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MonomialIsPrimary5


Define MappingConeRes5(X)
  Computation := "Effective_Mapping_Cone";
  Arguments := [Tagged(Gens(X),"PP_LIST")];
  Return $cocoa5.OperationCommunication(Computation, Arguments);
EndDefine; -- MappingConeRes5
 */

}  // end of namespace CoCoA

// RCS header/log in the next few lines
// $Header: /Volumes/Home_1/cocoa/cvs-repository/CoCoALib-0.99/src/AlgebraicCore/TmpMayerVietorisTree.C,v 1.18 2014/09/04 12:17:05 bigatti Exp $
// $Log: TmpMayerVietorisTree.C,v $
// Revision 1.18  2014/09/04 12:17:05  bigatti
// -- handy interface with ideal (should it be here or in MonomialIdeal?)
//
// Revision 1.17  2014/08/16 13:24:01  abbott
// Summary: Commented out an apparently unused fn
// Author: JAA
//
// Revision 1.16  2014/07/31 14:45:19  abbott
// Summary: Merged io.H and UtilsTemplate.H into new header VectorOperations.H
// Author: JAA
//
// Revision 1.15  2014/07/14 15:08:31  abbott
// Summary: Changed include of tmp.H into UtilsTemplate.H
// Author: JAA
//
// Revision 1.14  2014/04/30 16:24:15  abbott
// Summary: Replaced X.size() by len(X); Replaced size_t by long
// Author: JAA
//
// Revision 1.13  2012/05/28 09:18:20  abbott
// Created IntOperations which gathers together all operations on
// integers (both big and small).  Many consequential changes.
//
// Revision 1.12  2011/12/23 14:57:11  bigatti
// -- changed and --> && , or --> ||
//
// Revision 1.11  2011/03/11 11:06:14  bigatti
// -- changed size_t --> long
// -- changed size --> len
//
// Revision 1.10  2009/10/28 15:42:02  bigatti
// -- minor fixes for compilation warnings (int --> size_t)
//
// Revision 1.9  2009/10/28 10:12:22  bigatti
// -- updates by Eduardo Saenz-de-Cabezon
//
// Revision 1.8  2009/07/02 16:35:14  abbott
// Minor change: improved layout.  Maybe also something to keep the compiler quiet.
//
// Revision 1.7  2009/06/10 08:19:16  bigatti
// -- additions at the CoCoASchool
//
// Revision 1.6  2009/01/08 13:11:08  bigatti
// -- fixed MVTN1 bug (myOutPPsPtr is now initialized in myReadArgs)
//
// Revision 1.5  2008/07/17 16:35:55  bigatti
// -- use I instead on J in HasHomology
//
// Revision 1.4  2008/07/16 10:00:52  bigatti
// -- added: Betti diagram (by Eduardo Saenz-de-Cabezon)
//
// Revision 1.3  2008/07/04 12:12:56  bigatti
// -- added general MayerVietorisTree
//
// Revision 1.2  2008/07/04 09:11:04  bigatti
// -- new PPVector class
//
// Revision 1.1  2008/05/27 16:21:26  bigatti
// -- first import
//
